# KLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..KLevel Property
PipePressureDropData Class See Also
---
The system calculation level.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public SystemCalculationLevel KLevel { get; }
```

Visual Basic
---
```text
Public ReadOnly Property KLevel As SystemCalculationLevel
	Get
```

Visual C++
---
```text
public:
property SystemCalculationLevel KLevel {
	SystemCalculationLevel get ();
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace